"""  
SQL - Structured Query Language - язык структурированных запросов - язык общения с базами данных

База данных (БД -  DB) - организованная структура для хранения данных 

СУБД - Системы Управления Базами Данных - программы для управления базами данных

Базы данных бывают:
1) Реляционные - имеют связи между таблицами
2) Нереляционные - не имеют связей (ключ - значение)

PostgreSQL - СУБД, имеет встроенных функций, частые обновления, соответствует стандарту ACID, хранит данные на жестком диске

ACID - atomacity - атомарность, consistency - согласованность, isolation - изолированность, durabilty - стойкость

Категории запросов:
DDL (Data Definition Language) - работа над таблицами (CREATE, ALTER, DROP)
DML (Data Manipulation Language) - работа над данными в таблицах (SELECT, INSERT, UPDATE, DELETE)
TCL (Transaction Control Language) - работа с транзакциями (COMMIT, ROLLBACK, SAVEPOINT)
"""